#+STARTUP: overview
#+FILETAGS: :dr-dr:

* backlog
** TODO get views and subscriptions to work
   :CLOCK:
   CLOCK: [2016-12-02 Fri 08:48]--[2016-12-02 Fri 09:18] =>  0:30
   CLOCK: [2016-12-01 Thu 10:30]--[2016-12-01 Thu 10:51] =>  0:21
   CLOCK: [2016-12-01 Thu 10:02]--[2016-12-01 Thu 10:30] =>  0:28
   CLOCK: [2016-12-01 Thu 09:14]--[2016-12-01 Thu 10:02] =>  0:48
   :END:
- views + subscription breaks if i add "(reaction" to the subscription function
- check against https://github.com/Day8/re-frame/tree/master/examples
** Archive :ARCHIVE:
*** DONE initial setup
    CLOSED: [2016-11-29 Tue 10:21]
    :PROPERTIES:
    :ARCHIVE_TIME: 2016-11-29 Tue 10:21
    :END:
    :CLOCK:
    CLOCK: [2017-04-25 Tue 09:08]--[2017-04-25 Tue 09:22] =>  0:14
    CLOCK: [2016-11-29 Tue 09:18]--[2016-11-29 Tue 09:30] =>  0:12
    :END:
 - [2017-04-25 Tue] removed re-com
 - [2017-04-22 Sat] lein new re-frame insight +cider +test +routes +re-frisk +re-com +garden
 - lein new re-frame insight +cider +secretary +garden
   - https://github.com/Day8/re-frame
   - https://github.com/Day8/re-frame-template
   - XXX https://seancorfield.github.io/blog/2016/02/02/boot-new/
*** DONE setup figwheel + cider
    CLOSED: [2016-11-30 Wed 10:02]
    :PROPERTIES:
    :ARCHIVE_TIME: 2016-11-30 Wed 10:02
    :END:
    :CLOCK:
    CLOCK: [2016-11-30 Wed 08:57]--[2016-11-30 Wed 10:02] =>  1:05
    :END:
 - steps
   - shell: lein repl
   - emacs: cider-connect (C-c M-c)
   - repl: (require '[figwheel-sidecar.repl-api :as ra]) (ra/start-figwheel!) (ra/cljs-repl)
   - .cljs file: cider-repl-set-ns (C-c M-n)
* TODO design
:CLOCK:
CLOCK: [2016-10-24 Mon 04:20]--[2016-10-24 Mon 04:44] =>  0:24
:END:
** features
*** basic
**** store and retrieve data
***** type-1: during registration
***** type-2: on every visit
**** search-able data-fields (or simply search across all fields?)
*** advanced
**** allow to add/remove fields
***** customers won't pay monthly, unless i force (by not allowing them to use unless they pay)
**** auto backup on cloud
***** differentiate users (oauth2)
** technical
***
*** chrome app
**** https://developer.chrome.com/apps/about_apps
**** https://github.com/nwjs/nw.js/tree/master
* learn
** TODO http://electron.atom.io/
:CLOCK:
CLOCK: [2016-10-24 Mon 04:44]--[2016-10-24 Mon 05:59] =>  1:15
:END:
** TODO [[reagent][re-frame]]
   :CLOCK:
   CLOCK: [2017-04-22 Sat 16:39]--[2017-04-22 Sat 17:01] =>  0:22
   CLOCK: [2017-04-22 Sat 14:47]--[2017-04-22 Sat 16:19] =>  1:32
   CLOCK: [2016-11-29 Tue 09:30]--[2016-11-29 Tue 10:21] =>  0:51
   :END:
- https://github.com/Day8/re-frame
  - https://github.com/Day8/re-frame/tree/master/examples
  - https://github.com/Day8/re-frame/blob/master/docs/README.md
- https://github.com/Day8/re-frame-template
- XXX https://github.com/Day8/re-com
- XXX https://github.com/kristianmandrup/slush-reframe
** TODO [[https://github.com/magomimmo/modern-cljs][modern-cljs]]
   :CLOCK:
   CLOCK: [2016-11-15 Tue 06:10]--[2016-11-15 Tue 07:03] =>  0:53
   :END:
** [[https://github.com/gf3/secretary/][secretary]] + [[https://github.com/venantius/accountant][accountant]]
** [[https://github.com/plumatic/schema][schema]] / [[http://clojure.org/about/spec][clojure.spec]]
*** http://www.lispcast.com/clojure.spec-vs-schema
*** http://blog.cognitect.com/blog/2016/5/23/introducing-clojurespec
*** https://github.com/slagyr/speclj
** deferred
*** TODO [[https://github.com/boot-clj/boot#install][boot]]
    :CLOCK:
    CLOCK: [2016-11-15 Tue 06:03]--[2016-11-15 Tue 06:10] =>  0:07
    CLOCK: [2016-11-15 Tue 05:48]--[2016-11-15 Tue 06:03] =>  0:15
    CLOCK: [2016-11-15 Tue 05:35]--[2016-11-15 Tue 05:47] =>  0:12
    CLOCK: [2016-11-15 Tue 05:20]--[2016-11-15 Tue 05:35] =>  0:15
    CLOCK: [2016-11-13 Sun 05:20]--[2016-11-13 Sun 07:15] =>  1:55
    :END:
 - https://seancorfield.github.io/blog/2016/02/02/boot-new/
*** TODO [[https://github.com/mpdairy/posh][posh]]
 :CLOCK:
 - State "CANCELLED"  from "TODO"       [2016-11-15 Tue 05:43] \\
   not maintained for a long time
 CLOCK: [2016-11-03 Thu 04:43]--[2016-11-03 Thu 05:02] =>  0:19
 CLOCK: [2016-11-03 Thu 04:05]--[2016-11-03 Thu 04:35] =>  0:30
 :END:
****** https://github.com/mpdairy/posh-todo
*** TODO [[https://github.com/tonsky/datascript][datascript]]
 :CLOCK:
 CLOCK: [2016-11-02 Wed 04:07]--[2016-11-02 Wed 05:45] =>  1:38
 :END:
* trouble-shooting
** cljs + cider
   - https://github.com/bhauman/lein-figwheel/wiki/Using-the-Figwheel-REPL-within-NRepl#integration-with-emacscider
     - do `lein repl` instead of `lein figwheel dev`
     - `C-c M-c` from inside emacs to connect to repl
     - (do (require '[figwheel-sidecar.repl-api :as ra])
           (ra/start-figwheel!)
           (ra/cljs-repl))
     - now `C-c M-n` (change ns) works
     - (println "hello") works too!
     - yay!
** TODO lighttable
   :CLOCK:
   CLOCK: [2016-11-04 Fri 05:40]--[2016-11-04 Fri 05:52] =>  0:12
   CLOCK: [2016-11-03 Thu 07:00]--[2016-11-03 Thu 07:15] =>  0:15
   :END:
